template/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
{
    type            forces;

    libs            ("forces");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (modelGroup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Redundant for incompressible

    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}


// ************************************************************************* //
